//
//  Gendaiyougonokisotisiki2014JapaneseWordStore.m
//  BrainStorming
//
//  Created by 岡 大輔 on 2014/04/05.
//  Copyright (c) 2014年 岡 大輔. All rights reserved.
//
//「現代用語の基礎知識　２０１４」自由国民社

#import "Gendaiyougonokisotisiki2014JapaneseWordStore.h"

@implementation Gendaiyougonokisotisiki2014JapaneseWordStore

-(NSMutableArray *)GenerateWordArray
{
    NSMutableArray *SocialWordSore = [[NSMutableArray alloc] init];
    
    NSArray *seiji =@[@"ニュー・スピーク",@"金正日",@"将軍さま",@"ミサイルとロケット",@"飛翔体",@"事実上のミサイル",@"PAC3",@"SM3",@"日米同盟",@"集団的自衛権",@"同盟関係",@"第二次安倍内閣",
        @"憲法改正",@"歴史認識",@"第２３回参院選",@"衆参のねじれ",@"ネット選挙解禁",@"憲法96条",@"国防軍",@"国民投票法改正案",@"内閣法制局長官人事",@"憲法解釈の変更",@"日本版NSC",@"官邸主導",
        @"特定秘密保護法案",@"国会改革案",@"一票の格差",@"0増５減",@"一人別枠",@"原発新基準",@"再稼働",@"従軍慰安婦問題",
        @"橋下徹",@"河野談話",@"歴史認識",@"村山談話",@"主権回復の日",@"屈辱の日",@"マイナンバー制度",@"税と社会保障の一体改革",
        @"共通番号法",@"TPP",@"環太平洋経済連携協定",@"聖域なき関税撤廃",@"成年被後見人の選挙権",@"成年後見制度",
        @"道州制",@"道州制推進基本法",@"道州制国民会議",@"自治体首長と国会議員の兼職",@"日本未来の党",@"地方公務員の給与引き下げ問題",
        @"小平市住民投票",@"入札不調",@"震災復興事業",@"自治体の空き家対策",@"空き家対策推進議員連盟",@"安定多数",
        @"絶対安定多数",@"法案審議",@"法案提出権",@"日切れ法案",@"両院協議会",@"衆議院の優越性",@"党議拘束",@"議員立法",
        @"閣法",@"議員特権",@"不逮捕特権",@"免責特権",@"文書通信交通滞在費",@"議員年金",@"審議未了",@"継続審査",@"審議",
        @"会期不継続の原則",@"自然成立",@"国会決議",@"付帯決議",@"国会委員会",@"委員会",@"常任委員会",@"特別委員会",
        @"議院運営委員会",@"国対政治",@"国会対策委員会",@"首相指名",@"内閣不信任案",@"衆議院解散",@"問責決議案",
        @"解散",@"国政調査権",@"証人喚問",@"参考人招致",@"小泉内閣",@"郵政民営化",@"統一補欠選挙",@"補欠選挙",
        @"21世紀臨調",@"政治改革推進協議会",@"民間政治臨調",@"新しい日本をつくる国民会議",@"政府四演説",@"府政方針演説",
        @"所信表明演説",@"党首討論",@"国会審議活性化法",@"クエスチョンタイム",@"マニフェスト",@"政権公約",
        @"ローカル・マニフェスト",@"政治改革",@"行財政改革",@"政治改革大綱",@"独立行政法人化",@"連立内閣",
        @"閣内協力",@"閣外協力",@"部分連合",@"パーシャル連合",@"ねじれ国会",@"3分の２カード",@"60日ルール",@"30日ルール",
        @"衆議院の優越",@"公聴会",@"公述人",@"政治資金規正法",@"政治倫理審査会",@"陸山会事件",];
    
    [SocialWordSore addObjectsFromArray:seiji];
    
    return SocialWordSore;
}

//20140404  P118
//20140408  P122

@end
